# parameters
nc: 10  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors: 4 # p2, p3, p4, p5

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 6, 2, 2]],  # 0
   [-1, 1, Conv, [64, 3, 2]], # 1

   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, CrossConv, [64, 3, 1]],
   [[-1, -3], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1]], # 6
   [-1, 1, GAM, [64]],
   [-1, 1, Conv, [128, 3, 2]],

   [ -1, 1, Conv, [ 128, 1, 1 ] ],
   [ -1, 1, Conv, [ 128, 1, 1 ] ],
   [ -1, 1, CrossConv, [ 128, 3, 1 ] ],
   [ [ -1, -3 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 128, 1, 1 ] ], # 13
   [ -1, 1, GAM, [ 128 ] ],
   [ -1, 1, Conv, [ 256, 3, 2 ] ],

   [ -1, 1, Conv, [ 256, 1, 1 ] ],
   [ -1, 1, Conv, [ 256, 1, 1 ] ],
   [ -1, 1, CrossConv, [ 256, 3, 1 ] ],
   [ [ -1, -3 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 256, 1, 1 ] ], # 20
   [ -1, 1, GAM, [ 256 ] ],
   [ -1, 1, Conv, [ 512, 3, 2 ] ],

   [ -1, 1, Conv, [ 512, 1, 1 ] ],
   [ -1, 1, Conv, [ 512, 1, 1 ] ],
   [ -1, 1, CrossConv, [ 512, 3, 1 ] ],
   [ [ -1, -3 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 512, 1, 1 ] ], # 27
   [ -1, 1, GAM, [ 512 ] ],
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 29

   [-1, 1, Conv, [256, 3, 2]], # 30
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [20, 1, Conv, [256, 1, 1]],
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Bottleneck, [256]],
   [[-1, -3], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],

   [-1, 1, Conv, [128, 3, 2]], # 39
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, Bottleneck, [128]],
   [[-1, -3], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],

   [13, 1, Conv, [128, 1, 1]],
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [64, 3, 2]], # 48
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [ 6, 1, Conv, [ 64, 1, 1 ] ],
   [ [ -1, -2 ], 1, Concat, [ 1 ] ],

   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, Bottleneck, [64]],
   [[-1, -3], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1]], # 56

   [-1, 1, Conv, [64, 3, 2]],
   [ 48, 1, Conv, [ 64, 1, 1 ] ],
   [ [ -1, -2 ], 1, Concat, [ 1 ] ],

   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, Bottleneck, [64]],
   [[-1, -3], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1]], # 64

   [-1, 1, Conv, [128, 3, 2]],
   [39, 1, Conv, [128, 1, 1]],
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, Bottleneck, [128]],
   [[-1, -3], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 72

   [-1, 1, Conv, [256, 3, 2]],
   [30, 1, Conv, [256, 1, 1]],
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Bottleneck, [256]],
   [[-1, -3], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 80

   [56, 1, RepConv, [128, 3, 1]]
   [64, 1, RepConv, [256, 3, 1]],
   [72, 1, RepConv, [512, 3, 1]],
   [80, 1, RepConv, [1024, 3, 1]],

   [[81,82,83,84], 1, IDetect, [nc, anchors]],   # Detect(P2, P3, P4, P5)
  ]
