# parameters
nc: 10  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0

   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, Conv, [64, 3, 1]],

   [-1, 1, ELAG3, [128, 1, 1, True]], # 3-P2/4

   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 8-P3/8

   [-1, 1, ELAG3, [256, 1, 1, True]], # 9

   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 14-P4/16

   [-1, 1, ELAG3, [512, 1, 1, True]], # 15

   [-1, 1, MP, []],
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 20-P5/32

   [-1, 1, ELAG3, [512, 1, 1, True]], # 21
  ]

# yolov7 head
head:
  [[-1, 1, GSPPF, [512]], # 22

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [15, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, ELAG3, [256, 1, 1, False]], # 27

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [9, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, ELAG3, [128, 1, 1, False]], # 32

   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [3, 1, Conv, [64, 1, 1]], # route backbone P2
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, ELAG3, [64, 1, 1, False]], # 37

   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 32], 1, Concat, [1]],

   [-1, 1, ELAG3, [256, 1, 1, False]], # 42

   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 27], 1, Concat, [1]],

   [-1, 1, ELAG3, [512, 1, 1, False]], # 47

   [37, 1, RepConv, [128, 3, 1]],
   [42, 1, RepConv, [256, 3, 1]],
   [47, 1, RepConv, [512, 3, 1]],

   [[48,49,50], 1, IDetect, [nc, anchors]],   # Detect(P2, P3, P4)
  ]
